'''
-------------------------- PYTEST --------------------------

Tests/Тесты - проверка вашего кода, тесты бывают ручного типа и автотесты.

Pytest - это библиотека для тестирования кода.

'''
'''----------------------- Запуск тестов -------------------------'''

# pytest - запуск тестов с текущей директории и всех дочерних

# pytest test_name.py - запуск определенного теста

# pytest test_name.py::test_1 - запуск определенной тест-функции в определенном файле

'''Названия всех файлов с тестами должны начинаться на test_название.py либо наоборот название_test.py'''

'''Названия тест-функций должно начинаться с test_название'''