'''
GIT - распределенная система контроля версий.
Это система для отслеживания и ведения истории изменения файлов в вашем проекте.

Репозиторий (локальный/удаленный) - хранилице вашего кода и истории его изменений.

GitHub - веб сайт для размещения GIT 
'''

# Команды GIT:

# 1. git init - создает локальный гит  репозиторий у вас на пк, в той директории, в которой была прописана команда.

# 2. git status - команда для проверки статуса наших файлов.

# 3. git add - команда для добавления файлов в систему отслеживания гита, после этой команды изменения начинают фиксироваться.

# 4. git commit -m 'comment' - команда для сохранения версии в локальном репозитории вмесе с комментариями к изменениям.

john